wei-blip/Transmitter_sx1276_stm32/L152RE_sx1276/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SX1276_RST_Pin GPIO_PIN_0
#define SX1276_RST_GPIO_Port GPIOC
#define LED_EXT_Pin GPIO_PIN_3
#define LED_EXT_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define DIO_4_Pin GPIO_PIN_5
#define DIO_4_GPIO_Port GPIOC
#define DIO_4_EXTI_IRQn EXTI9_5_IRQn
#define SPI2_NSS_Pin GPIO_PIN_12
#define SPI2_NSS_GPIO_Port GPIOB
#define DIO_5_Pin GPIO_PIN_6
#define DIO_5_GPIO_Port GPIOC
#define DIO_5_EXTI_IRQn EXTI9_5_IRQn
#define DIO_3_Pin GPIO_PIN_8
#define DIO_3_GPIO_Port GPIOC
#define DIO_3_EXTI_IRQn EXTI9_5_IRQn
#define DIO_2_Pin GPIO_PIN_9
#define DIO_2_GPIO_Port GPIOC
#define DIO_2_EXTI_IRQn EXTI9_5_IRQn
#define DIO_1_Pin GPIO_PIN_10
#define DIO_1_GPIO_Port GPIOA
#define DIO_1_EXTI_IRQn EXTI15_10_IRQn
#define DIO_0_Pin GPIO_PIN_11
#define DIO_0_GPIO_Port GPIOA
#define DIO_0_EXTI_IRQn EXTI15_10_IRQn
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
